#*******************************************************************************************#
# 슬라이스 이용하여 문자열 자르기 => [시작점:끝점+1:증감폭]
#*******************************************************************************************#
univ = 'Inha University'
print(univ[5:])     #U ~ 끝
print(univ[5:15])   #U ~ 끝
print(univ[-10:])   #끝 ~ U
print(univ[::2])    #처음 ~ 끝 (증감폭 2)
print(univ[5:-6])   #슬라이스 범위 = 시작 ~ 끝 +1

#*******************************************************************************************#
#.split()
#*******************************************************************************************#
print(univ.split()) #원소가 2개인 리스트로 문자열을 나눔(공백을 기준으로 나눔), split()에서 ()안에 들어가는 문자가 기준(디폴트 = 스페이스 바)

#*******************************************************************************************#
#.join()
#*******************************************************************************************#
pokemons_list = ['피카츄','꼬부기','이상해씨','파이리']
pokemons_string = ','.join(pokemons_list)   # 리스트 안의 요소를 ,로 연결하여 문자열로 바꿈

#*******************************************************************************************
#.replace
#*******************************************************************************************#
inha = 'a duck goes in to a sea'
print(inha.replace('a','a nice'))   #sea의 a에서도 바뀜
print(inha.replace('a ', 'a nice')) #sea의 a에서는 안바뀜(by 띄어쓰기)

#*******************************************************************************************
#.strip()
#*******************************************************************************************#

subjects = ' $ python, data structure, database    '
print(subjects)
print(subjects.strip())     #문자열 양 끝 공백 삭제
print(subjects.strip('$'))  #공백으로 시작하는 문자열이므로 $는 없어지지 않음
#양 끝단에 연속적으로 붙어있는 문자들을 삭제한다!!
print(subjects.strip(' $')) #스페이스바 + $를 넣어줌으로 인해 앞단의 $삭제 가능

#*******************************************************************************************
#.find(),index()
#*******************************************************************************************#
print(subjects.find('data'),subjects.index('data'))