# list comprehension


#*********************************************************************************************************************
#기존 방식
#*********************************************************************************************************************
odd_lists = []
for i in range(1,11):
    if i % 2 == 1:
        odd_lists.append(i)
print(odd_lists,type(odd_lists))

#*********************************************************************************************************************
#comprehension
#*********************************************************************************************************************
odd_lists = [number for number in range(1,11) if number % 2 == 1]  #list comprehension
#odd_tuples = (number for number in range(1,11) if number % 2 == 1) tuple comprehension은 존재하지 않으므로 사용할 수 없음
print(odd_lists,type(odd_lists))